Kemerd/ADSBin/sdkconfig.defaults
# ============================================================================
#  ADSBin - default sdkconfig (seeds a fresh build; the real sdkconfig is
#  generated and git-ignored). Phase 0 scaffold scope: target, console, dual
#  core, custom partitions. USB-host tuning lands in Phase 1; WiFi/C6 Phase 10.
# ============================================================================

# --- Target -----------------------------------------------------------------
# ESP32-P4: dual-core RISC-V, USB 2.0 High-Speed OTG host. The HS host is the
# whole reason for this part - 2.4 Msps x 2 bytes ~= 4.8 MB/s of IQ is far past
# what a Full-Speed S3 could carry (IMPLEMENTATION_PLAN.md S5.1).
CONFIG_IDF_TARGET="esp32p4"

# --- Silicon revision -------------------------------------------------------
# Our physical dev board carries an EARLY P4 sample (rev v1.3). ESP-IDF v6
# defaults the P4 to the mass-production v3.x family, but rev <3.0 and >=3.0 are
# a "mutually exclusive" hardware split (see esp_hw_support P4 Kconfig): a v3.x
# image refuses to boot/flash on v1.x silicon. Opt into the pre-v3 family and
# set the minimum supported revision to v1.0 so this v1.3 chip is in range.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# --- Console / logging ------------------------------------------------------
# The P4's USB-C port is power + debug, carrying console/monitor AND the MVP
# GDL90 / sink_debug stream (S1.1, S4.5). The transport chip depends on the
# board, though: THIS dev board routes its single USB-C jack through an on-board
# CH343 USB-UART bridge wired to the P4's default download UART (UART0) — the
# native USB-Serial/JTAG controller has no connector. So the console must be on
# UART0, not USB-Serial/JTAG, or nothing reaches the host (and the bench can't
# feed packets in). UART0's pre-defined GPIOs are the same pins esptool flashes
# over, which is why flashing works on this board. Boards that break out the
# native USB-C port can switch this back to CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- FreeRTOS / SMP ---------------------------------------------------------
# Keep BOTH cores online. Core 0 is the hard-real-time RX+DSP path, Core 1 is
# decode + serve (S2). Never enable UNICORE. 1 kHz tick gives 1 ms aging math.
# CONFIG_FREERTOS_UNICORE is not set
CONFIG_FREERTOS_HZ=1000

# --- Flash / partitions -----------------------------------------------------
# 16 MB assumed (typical P4 dev board). If your board differs, change this one
# line; the partition layout fits in 8 MB too. Two OTA app slots leave room for
# field firmware updates without a serial cable later.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Logging verbosity (bring-up) ------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- WiFi via on-board ESP32-C6 (esp-hosted) -------------------------------
# The P4 has no radio; it reaches WiFi through the on-board C6 over SDIO. The
# esp_wifi_remote managed component (pulled by main/idf_component.yml) re-exports
# the standard esp_wifi.h API and RPCs it to the C6. Select its HOSTED backend
# (the esp-hosted SDIO transport) rather than the EPPP/UART one. This symbol is
# stable across versions; still verify it survives reconfigure:
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
#
# Slave target = ESP32-C6. RESOLVED (verified after reconfigure 2026-06-09): the
# esp_hosted Kconfig defaults already select the C6 once HOSTED is enabled above
# — sdkconfig resolves CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y on its own, so we do
# NOT pin it here (kconfgen silently drops an unknown CONFIG_ name, so an active
# wrong guess is worse than relying on the confirmed default). The real symbol is
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6 (gated by SLAVE_IDF_TARGET_ESP32C6); the
# other two candidates below were WRONG names. Left documented, not active:
# CONFIG_SLAVE_IDF_TARGET_ESP32C6=y          (a dependency symbol, auto-set)
# CONFIG_ESP_HOSTED_TARGET_ESP32C6=y         (WRONG: no such symbol)
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y      (REAL name; auto-resolves, no need to pin)
#
# SDIO PIN MAP: the C6<->P4 SDIO pins are board-specific and ALSO live in the
# esp_hosted Kconfig. The Waveshare ESP32-P4-WIFI6 pinout may differ from the
# Espressif Function-EV reference (CLK=18,CMD=19,D0=14,D1=15,D2=16,D3=17,
# reset=GPIO54). VERIFY against the Waveshare schematic after reconfigure and
# add the board's CONFIG_ESP_HOSTED_SDIO_* overrides here if they differ.
# (Confirmed 2026-06-09: the SDIO link comes up on the Waveshare with the stock
# defaults - "H_SDIO_DRV: sdio_data_to_rx_buf_task started" at boot.)

# --- External PSRAM (on-package 32 MB) -------------------------------------
# REQUIRED ONCE WIFI IS LINKED. The esp_hosted + esp_wifi_remote + lwip stack
# reserves a large slab of INTERNAL SRAM at startup; without PSRAM that starved
# demod1090's 128 KB magnitude LUT (MALLOC_CAP_INTERNAL) and the box boot-looped
# on ESP_ERR_NO_MEM. Turning on the package PSRAM and steering the WiFi/lwIP
# buffers into it frees the internal SRAM back up so the hot-path LUT still lives
# in fast internal RAM (we deliberately DON'T move the LUT to slower PSRAM - it is
# hit per IQ sample on the Core-0 DSP path).
CONFIG_SPIRAM=y
# HEX (16-line) PSRAM is the only mode the P4 package supports; 200 MHz is the
# default and the fastest available on our rev <3 silicon (250 MHz is gated to
# rev >=3 by Kconfig, and we run rev v1.3 - see ESP32P4_SELECTS_REV_LESS_V3).
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
# Let the heap allocator hand out PSRAM, and prefer it for the big WiFi/lwIP
# buffers specifically - this is the targeted relief for the SRAM pressure above.
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- USB Host: external hub support (dual-dongle topology) ------------------
# MAKE-OR-BREAK for the two-dongle build. The user plugs a USB hub into the P4's
# single HS host root port so TWO NESDR sticks (one tuned 1090 traffic, one tuned
# 978 UAT weather) enumerate behind it. The ESP-IDF USB Host stack DISABLES
# external-hub support by default (CONFIG_USB_HOST_HUBS_SUPPORTED defaults n);
# with it off, anything behind a hub is simply never enumerated and the second
# dongle is invisible. Turn it on. This is purely additive — a single dongle wired
# DIRECTLY to the root port (no hub) still enumerates exactly as before, so the
# 1090-only path is unaffected.
CONFIG_USB_HOST_HUBS_SUPPORTED=y
# A single 4-port hub is one level deep (level 1). MULTI_LEVEL (cascaded hubs)
# defaults y already; we leave it on so a hub-behind-a-hub still works, but the
# supported topology is one hub. Per-port reset/debounce timings stay at their
# Kconfig defaults — only revisit them if a specific stick fails to enumerate.
CONFIG_USB_HOST_HUB_MULTI_LEVEL=y

# Place USB Host DMA buffers in PSRAM. The bulk-IN URBs for raw IQ are large
# (see RTLSDR_URB_SIZE x RTLSDR_NUM_URBS per dongle); with TWO dongles they do not
# fit in the P4's ~640 KB internal RAM and alloc_urbs() fails with ESP_ERR_NO_MEM,
# so streaming never starts (BLK=0). The P4 has 32 MB PSRAM and its USB DWC DMA can
# reach it, so route the host stack's DMA-capable allocations there.
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y
